In [1]:
import pandas as pd

In [10]:
list1 = [1,2,3,4]
list2 = ['one', 'two', 'three', 'four']
list3 = ['일', '이', None, None]

s1 = pd.core.series.Series(list1)
s2 = pd.core.series.Series(list2)
s3 = pd.core.series.Series(list3)

In [11]:
df = pd.DataFrame(data=dict(num=s1, word=s2, korean = s3))
df

  korean  num   word
0      일    1    one
1      이    2    two
2   None    3  three
3   None    4   four

In [12]:
df.shape

(4, 3)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
korean    2 non-null object
num       4 non-null int64
word      4 non-null object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

버젼이 달라 isna가 아닌 isnull로 사용

In [17]:
df.isnull()

   korean    num   word
0   False  False  False
1   False  False  False
2    True  False  False
3    True  False  False

None값 찾으면 '특정 값'으로 바꾼다

In [24]:
df.korean = df.korean.fillna('영')

In [26]:
df

  korean  num   word
0      일    1    one
1      이    2    two
2      영    3  three
3      영    4   four

적당한 값으로 변경 보통 일반적으로는 평균이나 중간값을 사용한다고함<br>
다시 값을 정해보자

In [28]:
friends = [
        ['name', ['beom', 'seek', 'wan', 'luffy', 'zoro', 'franky']],
        ['age', [28, None, 29, 17, None, 35]],
        ['job', ['student', 'student','student', 'pirate', 'pirate', 'pirate']]
]

df = pd.DataFrame.from_items(friends)
df

     name   age      job
0    beom  28.0  student
1    seek   NaN  student
2     wan  29.0  student
3   luffy  17.0   pirate
4    zoro   NaN   pirate
5  franky  35.0   pirate

In [29]:
df.isnull()

    name    age    job
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False  False
4  False   True  False
5  False  False  False

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name    6 non-null object
age     4 non-null float64
job     6 non-null object
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

# 밑에 의미는 group으로 나누는데 'job'에 따른 나이를 계산하는 것<br>
따라서 'student'는 'student'끼리 중간값을 계산 'pirate'는 'pirate'끼리 계산하고 inplace는 df원본을 바꾸라는 의미

In [33]:
df['age'].fillna(df.groupby('job')['age'].transform('median'), inplace = True)

In [34]:
df

     name   age      job
0    beom  28.0  student
1    seek  28.5  student
2     wan  29.0  student
3   luffy  17.0   pirate
4    zoro  26.0   pirate
5  franky  35.0   pirate